richlegrand/psi_esp32/main/httpd_server.cpp
/**
 * PSI WebRTC Server for ESP32
 *
 * Provides WebRTC connectivity with SWSP protocol support for HTTP-like
 * request/response over DataChannel.
 *
 * Ported from libdatachannel_device/httpd_server.cpp
 */

#include "httpd_server.hpp"
#include "esp32_video.hpp"
#include <cJSON.h>
#include <cstring>
#include "esp_log.h"
#include "esp_crt_bundle.h"
#include "esp32_psram_init.h"
#include "esp_timer.h"

// libdatachannel headers for video streaming
#include "rtc/h264rtppacketizer.hpp"
#include "rtc/rtcpsrreporter.hpp"
#include "rtc/rtcpnackresponder.hpp"
#include "rtc/frameinfo.hpp"

static const char* TAG = "WebRTC";

using namespace rtc;

//=============================================================================
// WebRTCSession Implementation
//=============================================================================

WebRTCSession::WebRTCSession(const std::string& client_id,
                             std::shared_ptr<PeerConnection> pc,
                             std::shared_ptr<DataChannel> dc)
    : client_id_(client_id), pc_(pc), dc_(dc) {
    ESP_LOGI(TAG, "WebRTCSession created for client: %s", client_id.c_str());
}

WebRTCSession::~WebRTCSession() {
    ESP_LOGI(TAG, "WebRTCSession destroyed for client: %s", client_id_.c_str());
}

void WebRTCSession::sendSwspFrame(uint32_t stream_id, uint16_t flags, const std::vector<uint8_t>& payload) {
    if (!dc_ || !dc_->isOpen()) {
        ESP_LOGE(TAG, "DataChannel not open, cannot send frame");
        return;
    }

    // Build SWSP frame: [stream_id:4][flags:2][length:2][payload:N]
    std::vector<uint8_t> frame(8 + payload.size());

    // Little Endian encoding
    frame[0] = stream_id & 0xFF;
    frame[1] = (stream_id >> 8) & 0xFF;
    frame[2] = (stream_id >> 16) & 0xFF;
    frame[3] = (stream_id >> 24) & 0xFF;

    frame[4] = flags & 0xFF;
    frame[5] = (flags >> 8) & 0xFF;

    uint16_t length = payload.size();
    frame[6] = length & 0xFF;
    frame[7] = (length >> 8) & 0xFF;

    // Copy payload
    std::copy(payload.begin(), payload.end(), frame.begin() + 8);

    // Send
    dc_->send(reinterpret_cast<const std::byte*>(frame.data()), frame.size());
}

void WebRTCSession::sendSwspFrame(uint32_t stream_id, uint16_t flags, const std::string& payload) {
    std::vector<uint8_t> data(payload.begin(), payload.end());
    sendSwspFrame(stream_id, flags, data);
}

const httpd_uri_t* WebRTCSession::findHandler(const char* uri, httpd_method_t method) {
    if (!handlers_) return nullptr;

    for (const auto& h : *handlers_) {
        if (strcmp(h.uri, uri) == 0 && (h.method == method || h.method == HTTP_ANY)) {
            return &h;
        }
    }
    return nullptr;
}

void WebRTCSession::handleSwspFrame(const rtc::binary& frame_data) {
    if (frame_data.size() < 8) {
        ESP_LOGE(TAG, "Frame too small: %d", (int)frame_data.size());
        return;
    }

    // Parse SWSP header (Little Endian)
    const uint8_t* data = reinterpret_cast<const uint8_t*>(frame_data.data());

    uint32_t stream_id = data[0] | (data[1] << 8) | (data[2] << 16) | (data[3] << 24);
    uint16_t flags = data[4] | (data[5] << 8);
    uint16_t length = data[6] | (data[7] << 8);

    std::vector<uint8_t> payload(data + 8, data + 8 + length);

    ESP_LOGI(TAG, "Received frame: stream_id=%lu flags=0x%04x length=%d",
             (unsigned long)stream_id, flags, length);

    // Parse request (FLAG_SYN | FLAG_FIN)
    if ((flags & FLAG_SYN) && (flags & FLAG_FIN)) {
        // Parse JSON request
        std::string json_str(payload.begin(), payload.end());

        cJSON* req_json = cJSON_Parse(json_str.c_str());
        if (!req_json) {
            ESP_LOGE(TAG, "Failed to parse request JSON");
            return;
        }

        ESP_LOGI(TAG, "Request: %s", json_str.c_str());

        // Build httpd_req_t
        httpd_req_t req = {};
        auto aux = new httpd_req_aux();

        aux->stream_id = stream_id;
        aux->session = shared_from_this();

        cJSON* method_item = cJSON_GetObjectItem(req_json, "method");
        cJSON* pathname_item = cJSON_GetObjectItem(req_json, "pathname");

        if (method_item && cJSON_IsString(method_item)) {
            aux->method_str = method_item->valuestring;
        }
        if (pathname_item && cJSON_IsString(pathname_item)) {
            aux->uri_str = pathname_item->valuestring;
        }

        // Set method
        if (aux->method_str == "GET") req.method = HTTP_GET;
        else if (aux->method_str == "POST") req.method = HTTP_POST;
        else if (aux->method_str == "PUT") req.method = HTTP_PUT;
        else if (aux->method_str == "DELETE") req.method = HTTP_DELETE;
        else req.method = HTTP_GET;

        // Copy URI (cast away const since we're constructing the request ourselves)
        char* uri_ptr = const_cast<char*>(req.uri);
        strncpy(uri_ptr, aux->uri_str.c_str(), sizeof(req.uri) - 1);
        uri_ptr[sizeof(req.uri) - 1] = '\0';

        req.aux = aux;
        req.content_len = 0;  // TODO: parse body

        cJSON_Delete(req_json);

        // Find and dispatch handler to Internal RAM task
        const httpd_uri_t* handler = findHandler(req.uri, (httpd_method_t)req.method);
        if (handler) {
            req.user_ctx = handler->user_ctx;

            // CRITICAL: Execute handler on Internal RAM task to allow file I/O
            // The current thread (libdatachannel ThreadPool worker) has PSRAM stack
            esp_err_t result = HandlerDispatcher::Instance().executeHandler(&req, handler);
            if (result != ESP_OK) {
                ESP_LOGE(TAG, "Handler returned error: %d", result);
            }
        } else {
            ESP_LOGE(TAG, "No handler found for: %s", req.uri);
            // Send 404
            httpd_resp_send_err(&req, HTTPD_404_NOT_FOUND, "Not Found");
        }

        // Cleanup
        delete aux;
    }
}

//=============================================================================
// WebRTCServer Implementation
//=============================================================================

WebRTCServer::WebRTCServer(const std::string& uid, const std::string& server_url)
    : uid_(uid), server_url_(server_url) {
    ESP_LOGI(TAG, "WebRTCServer created for UID: %s", uid.c_str());
}

WebRTCServer::~WebRTCServer() {
    stop();
}

