richlegrand/psi_esp32/main/httpd_server.cpp
        dc->onMessage([session](std::variant<rtc::binary, std::string> data) {
            if (std::holds_alternative<rtc::binary>(data)) {
                session->handleSwspFrame(std::get<rtc::binary>(data));
            }
        });

        addSession(client_id, session);
    });

    // Add video track (will be included in offer)
    const uint8_t payloadType = 96;
    const uint32_t ssrc = std::hash<std::string>{}(client_id) & 0xFFFFFFFF;  // Unique SSRC per client
    const std::string cname = "video-stream";

    Description::Video media(cname, Description::Direction::SendOnly);
    media.addH264Codec(payloadType);
    media.addSSRC(ssrc, cname, "stream1", cname);
    auto video_track = pc->addTrack(media);

    // Create RTP configuration
    auto rtpConfig = std::make_shared<RtpPacketizationConfig>(ssrc, cname, payloadType, H264RtpPacketizer::ClockRate);

    // Create H.264 packetizer - use StartSequence for Annex-B format from ESP32 encoder
    auto packetizer = std::make_shared<H264RtpPacketizer>(NalUnit::Separator::StartSequence, rtpConfig);

    // Add RTCP SR handler
    auto srReporter = std::make_shared<RtcpSrReporter>(rtpConfig);
    packetizer->addToChain(srReporter);

    // Add RTCP NACK handler (with reduced size for ESP32 memory constraints)
    auto nackResponder = std::make_shared<RtcpNackResponder>();
    packetizer->addToChain(nackResponder);

    // Set media handler
    video_track->setMediaHandler(packetizer);

    // Set onOpen callback - start video if this is the first track
    video_track->onOpen([this, client_id]() {
        ESP_LOGI(TAG, "Video track opened for client: %s", client_id.c_str());

        // Start video capture if not already running
        if (!video_running_) {
            startVideoStream();
        }
    });

    // Store video track for sending frames
    {
        std::lock_guard<std::mutex> lock(video_tracks_mutex_);
        video_tracks_[client_id] = video_track;
    }

    ESP_LOGI(TAG, "Added video track for client: %s (SSRC: %u)", client_id.c_str(), ssrc);

    // Create offer (no remote description yet)
    pc->setLocalDescription();
}

void WebRTCServer::handleAnswer(const std::string& client_id, const std::string& sdp) {
    ESP_LOGI(TAG, "Received answer from client: %s", client_id.c_str());

    std::shared_ptr<PeerConnection> pc;
    {
        std::lock_guard<std::mutex> lock(sessions_mutex_);
        auto it = peer_connections_.find(client_id);
        if (it == peer_connections_.end()) {
            ESP_LOGE(TAG, "No PeerConnection found for client: %s", client_id.c_str());
            return;
        }
        pc = it->second;
    }

    // Set remote description (browser's answer)
    pc->setRemoteDescription(Description(sdp, "answer"));
    ESP_LOGI(TAG, "Remote description set for client: %s", client_id.c_str());
}

void WebRTCServer::handleCandidate(const std::string& client_id, const std::string& candidate,
                                    const std::string& mid) {
    ESP_LOGI(TAG, "Received candidate from client: %s", client_id.c_str());

    std::shared_ptr<PeerConnection> pc;
    {
        std::lock_guard<std::mutex> lock(sessions_mutex_);
        auto it = peer_connections_.find(client_id);
        if (it == peer_connections_.end()) {
            ESP_LOGE(TAG, "No PeerConnection found for client: %s", client_id.c_str());
            return;
        }
        pc = it->second;
    }

    try {
        pc->addRemoteCandidate(Candidate(candidate, mid));
        ESP_LOGI(TAG, "Added remote candidate");
    } catch (const std::exception& e) {
        ESP_LOGE(TAG, "Failed to add candidate: %s", e.what());
    }
}

void WebRTCServer::sendSignalingMessage(const std::string& message) {
    if (!ws_client_ || !esp_websocket_client_is_connected(ws_client_)) {
        ESP_LOGE(TAG, "WebSocket not connected");
        return;
    }

    ESP_LOGI(TAG, "Sending signaling message, len=%d", (int)message.length());
    int ret = esp_websocket_client_send_text(ws_client_, message.c_str(), message.length(), portMAX_DELAY);
    if (ret < 0) {
        ESP_LOGE(TAG, "Failed to send signaling message, ret=%d", ret);
    }
}

void WebRTCServer::addSession(const std::string& client_id, std::shared_ptr<WebRTCSession> session) {
    std::lock_guard<std::mutex> lock(sessions_mutex_);
    if (sessions_.size() >= MAX_SESSIONS) {
        ESP_LOGE(TAG, "Max sessions reached, rejecting client: %s", client_id.c_str());
        return;
    }
    sessions_[client_id] = session;
    session->setHandlers(&uri_handlers_);
    ESP_LOGI(TAG, "Session added: %s (total: %d)", client_id.c_str(), (int)sessions_.size());
}

void WebRTCServer::removeSession(const std::string& client_id) {
    std::lock_guard<std::mutex> lock(sessions_mutex_);
    auto it = sessions_.find(client_id);
    if (it != sessions_.end()) {
        sessions_.erase(it);
        ESP_LOGI(TAG, "Session removed: %s (total: %d)", client_id.c_str(), (int)sessions_.size());
    }
    // Also remove PeerConnection
    auto pc_it = peer_connections_.find(client_id);
    if (pc_it != peer_connections_.end()) {
        peer_connections_.erase(pc_it);
    }

    // Remove video track
    {
        std::lock_guard<std::mutex> lock_video(video_tracks_mutex_);
        auto vt_it = video_tracks_.find(client_id);
        if (vt_it != video_tracks_.end()) {
            video_tracks_.erase(vt_it);
            ESP_LOGI(TAG, "Video track removed for client: %s", client_id.c_str());

            // Stop video if no more tracks
            if (video_tracks_.empty() && video_running_) {
                stopVideoStream();
            }
        }
    }
}

std::shared_ptr<WebRTCSession> WebRTCServer::getSession(const std::string& client_id) {
    std::lock_guard<std::mutex> lock(sessions_mutex_);
    auto it = sessions_.find(client_id);
    return (it != sessions_.end()) ? it->second : nullptr;
}

esp_err_t WebRTCServer::registerHandler(const httpd_uri_t* uri_handler) {
    if (!uri_handler) {
        return ESP_ERR_INVALID_ARG;
    }

    // Check for duplicates
    for (const auto& h : uri_handlers_) {
        if (strcmp(h.uri, uri_handler->uri) == 0 && h.method == uri_handler->method) {
            return ESP_ERR_HTTPD_HANDLER_EXISTS;
        }
    }

    uri_handlers_.push_back(*uri_handler);
    ESP_LOGI(TAG, "Registered handler: %s", uri_handler->uri);
    return ESP_OK;
}

void WebRTCServer::start() {
    ESP_LOGI(TAG, "Starting WebRTCServer...");

    // Initialize handler dispatcher with Internal RAM stack (for file I/O)
    HandlerDispatcher::Instance().initialize();

    running_ = true;

    // Build WebSocket URL
    std::string ws_url = "wss://" + server_url_ + "/ws/device/" + uid_;

    esp_websocket_client_config_t websocket_cfg = {};
    websocket_cfg.uri = ws_url.c_str();
    // 32KB stack: Required for regex-based SDP parsing in libdatachannel
    // (complex RFC 3986 URL regex causes deep recursion)
    // Parent project dispatches SDP parsing to MainThread to avoid this
    websocket_cfg.task_stack = 32768;
    websocket_cfg.buffer_size = 4096;  // Increased from 2KB to handle large server headers
    websocket_cfg.reconnect_timeout_ms = 10000;  // Explicit to suppress warning
    websocket_cfg.network_timeout_ms = 10000;  // Explicit to suppress warning

    // WebSocket keepalive: Send PING every 60 seconds (typical production value)
    // This prevents timeout when no signaling messages are being exchanged
    // (after WebRTC connection is established, signaling goes idle)
    websocket_cfg.ping_interval_sec = 60;
    websocket_cfg.pingpong_timeout_sec = 120;  // Disconnect if no PONG received within 2 minutes
    websocket_cfg.disable_pingpong_discon = false;  // Enable auto-disconnect on timeout

    // TCP keepalive: Detect dead connections at TCP layer (typical production values)
    websocket_cfg.keep_alive_enable = true;
    websocket_cfg.keep_alive_idle = 300;     // Send TCP keepalive after 5 minutes of idle
    websocket_cfg.keep_alive_interval = 75;  // Retry every 75s (Linux standard)
    websocket_cfg.keep_alive_count = 9;      // 9 retries before considering connection dead

    // TLS configuration for secure WebSocket (WSS)
    // Use ESP-IDF's certificate bundle for CA verification
    websocket_cfg.crt_bundle_attach = esp_crt_bundle_attach;

    ESP_LOGI(TAG, "Connecting to: %s", ws_url.c_str());

