richlegrand/psi_esp32/main/httpd_server.cpp
    if (video_capture_) {
        video_capture_->stop();
        video_capture_->close();
        video_capture_.reset();
    }

    ESP_LOGI(TAG, "Video stream stopped");
}

void WebRTCServer::sendVideoFrame(const uint8_t* data, size_t size, uint64_t timestamp_us, bool keyframe) {
    if (!video_running_ || !data || size == 0) {
        return;
    }

    // Initialize PTS on first frame
    if (video_start_pts_ == 0) {
        video_start_pts_ = timestamp_us;
    }

    // Calculate relative PTS in seconds
    double pts_sec = (timestamp_us - video_start_pts_) / 1000000.0;
    std::chrono::duration<double> frameTime(pts_sec);
    FrameInfo frameInfo(frameTime);

    // Log keyframes
    if (keyframe) {
        ESP_LOGI(TAG, "Sending keyframe: %u bytes, PTS: %.3f s", size, pts_sec);
    }

    // Send frame to all connected video tracks
    std::lock_guard<std::mutex> lock(video_tracks_mutex_);
    for (auto& [client_id, track] : video_tracks_) {
        if (track && track->isOpen()) {
            try {
                track->sendFrame(reinterpret_cast<const std::byte*>(data), size, frameInfo);

                // Log every 30 frames to avoid spam
                static int frame_counter = 0;
                if (++frame_counter % 30 == 0) {
                    ESP_LOGI(TAG, "Sent %d frames to %s", frame_counter, client_id.c_str());
                }
            } catch (const std::exception& e) {
                ESP_LOGE(TAG, "Failed to send video frame to %s: %s", client_id.c_str(), e.what());
            }
        }
    }
}
